HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxHsct_regdef.h
/** \\brief  Interrupt enable register */
typedef struct _Ifx_HSCT_IRQEN_Bits
{
    unsigned int reserved_0:1;              /**< \brief \internal Reserved */
    unsigned int HEREN:1;                   /**< \brief [1:1] Header error detected interrupt enable (rw) */
    unsigned int PYEREN:1;                  /**< \brief [2:2] Payload error detected interrupt enable (rw) */
    unsigned int CEREN:1;                   /**< \brief [3:3] HSCT command error interrupt enable (rw) */
    unsigned int IFCFSEN:1;                 /**< \brief [4:4] HSCT interface control command send enable (rw) */
    unsigned int SMEREN:1;                  /**< \brief [5:5] Speed Mode Switch Error interrupt enable (rw) */
    unsigned int USMSFEN:1;                 /**< \brief [6:6] Unsolicited message frame send finished (rw) */
    unsigned int PLEREN:1;                  /**< \brief [7:7] PLL lost lock error interrupt enable (rw) */
    unsigned int USMEN:1;                   /**< \brief [8:8] Unsolicited Message received enable (rw) */
    unsigned int PAREN:1;                   /**< \brief [9:9] PING Answer Received enable (rw) */
    unsigned int TXTEEN:1;                  /**< \brief [10:10] TX disable error interrupt enable (rw) */
    unsigned int SFOEN:1;                   /**< \brief [11:11] Synchronization FIFO overflow (in RX direction) interrupt enable (rw) */
    unsigned int SFUEN:1;                   /**< \brief [12:12] Synchronization FIFO underflow (in TX direction) interrupt enable (rw) */
    unsigned int reserved_13:19;            /**< \brief \internal Reserved */
} Ifx_HSCT_IRQEN_Bits;

/** \\brief  Reset Register 0 */
typedef struct _Ifx_HSCT_KRST0_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int RSTSTAT:1;                 /**< \brief [1:1] Kernel Reset Status (rh) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_HSCT_KRST0_Bits;

/** \\brief  Reset Register 1 */
typedef struct _Ifx_HSCT_KRST1_Bits
{
    unsigned int RST:1;                     /**< \brief [0:0] Kernel Reset (rwh) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_HSCT_KRST1_Bits;

/** \\brief  Reset Status Clear Register */
typedef struct _Ifx_HSCT_KRSTCLR_Bits
{
    unsigned int CLR:1;                     /**< \brief [0:0] Kernel Reset Status Clear (w) */
    unsigned int reserved_1:31;             /**< \brief \internal Reserved */
} Ifx_HSCT_KRSTCLR_Bits;

/** \\brief  OCDS Control and Status */
typedef struct _Ifx_HSCT_OCS_Bits
{
    unsigned int TGS:2;                     /**< \brief [1:0] Trigger Set for OTGB0/1 (rw) */
    unsigned int TGB:1;                     /**< \brief [2:2] OTGB0/1 Bus Select (rw) */
    unsigned int TG_P:1;                    /**< \brief [3:3] TGS, TGB Write Protection (w) */
    unsigned int reserved_4:20;             /**< \brief \internal Reserved */
    unsigned int SUS:4;                     /**< \brief [27:24] OCDS Suspend Control (rw) */
    unsigned int SUS_P:1;                   /**< \brief [28:28] SUS Write Protection (w) */
    unsigned int SUSSTA:1;                  /**< \brief [29:29] Suspend State (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_HSCT_OCS_Bits;

/** \\brief  Sleep Control Register */
typedef struct _Ifx_HSCT_SLEEPCTRL_Bits
{
    unsigned int SLPEN:1;                   /**< \brief [0:0] Sleep mode enabled (rw) */
    unsigned int SLPCLKG:1;                 /**< \brief [1:1] Clock Gating in Sleep Mode (rw) */
    unsigned int reserved_2:30;             /**< \brief \internal Reserved */
} Ifx_HSCT_SLEEPCTRL_Bits;

/** \\brief  Status Register */
typedef struct _Ifx_HSCT_STAT_Bits
{
    unsigned int RX_PSIZE:3;                /**< \brief [2:0] RX (receiving) Payload Size (rh) */
    unsigned int RX_CHANNEL:4;              /**< \brief [6:3] RX (receiving) Logical Channel Type (rh) */
    unsigned int RX_SLEEP:1;                /**< \brief [7:7] RX (receiving) Sleep Mode Status (rh) */
    unsigned int TX_SLEEP:1;                /**< \brief [8:8] TX (transmitting) Sleep Mode Status (rh) */
    unsigned int reserved_9:3;              /**< \brief \internal Reserved */
    unsigned int TX_PSIZE:3;                /**< \brief [14:12] Transmission Payload Size (rh) */
    unsigned int reserved_15:1;             /**< \brief \internal Reserved */
    unsigned int TX_CHANNEL_TYPE:4;         /**< \brief [19:16] Transmission Logical Channel Type (rh) */
    unsigned int reserved_20:4;             /**< \brief \internal Reserved */
    unsigned int LIFCCMDR:8;                /**< \brief [31:24] Last Interface Control Command Received (rh) */
} Ifx_HSCT_STAT_Bits;

/** \\brief  STATPHY */
typedef struct _Ifx_HSCT_STATPHY_Bits
{
    unsigned int PLOCK:1;                   /**< \brief [0:0] PLL locked (rh) */
    unsigned int RXLSA:1;                   /**< \brief [1:1] Receiver in Low speed (rh) */
    unsigned int TXLSA:1;                   /**< \brief [2:2] Transmitter in Low speed (rh) */
    unsigned int reserved_3:29;             /**< \brief \internal Reserved */
} Ifx_HSCT_STATPHY_Bits;

/** \\brief  Unsolicited Status Message Received */
typedef struct _Ifx_HSCT_USMR_Bits
{
    unsigned int USMR:32;                   /**< \brief [31:0] Unsolicited status message received (rh) */
} Ifx_HSCT_USMR_Bits;

/** \\brief  Unsolicited Status Message Send */
typedef struct _Ifx_HSCT_USMS_Bits
{
    unsigned int USMS:32;                   /**< \brief [31:0] Unsolicited status message send (rw) */
} Ifx_HSCT_USMS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Hsct_union
 * \{  */

/** \\brief  Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSCT_ACCEN0_Bits B;
} Ifx_HSCT_ACCEN0;

/** \\brief  Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSCT_ACCEN1_Bits B;
} Ifx_HSCT_ACCEN1;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSCT_CLC_Bits B;
} Ifx_HSCT_CLC;

/** \\brief  Configuration physical layer register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSCT_CONFIGPHY_Bits B;
} Ifx_HSCT_CONFIGPHY;

